


/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3*/



// Console.Write("a: "); 
// int num1 = Convert.ToInt32(Console.ReadLine()); 
// Console.Write("b: "); 
// int num2 = Convert.ToInt32(Console.ReadLine());

// if(num1 > num2)
// { 
//       Console.WriteLine($"max = {num1}");
// }
// else if (num1 < num2)
// {
//       Console.WriteLine($"max = {num2}");
// }
// else
// {
//       Console.WriteLine("Оба числа равни,Введите новое число ");
// }



/*Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22*/

// int numberA = new Random().Next(1,100);
// Console.WriteLine(numberA);
// int numberB = new Random().Next(1,100);
// Console.WriteLine(numberB);
// int numberC = new Random().Next(1,100);
// Console.WriteLine(numberC);
 
//  int max = numberA;

// if (numberA > max) max = numberA;
// if (numberB > max) max = numberB;
// if (numberC > max) max = numberC;
// Console.Write("max= ");
// Console.WriteLine(max);



/*Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет*/

// Console.WriteLine("Введите число: "); 
//  int num = Convert.ToInt32(Console.ReadLine());
//  if (num % 2 == 0)
//  {
//  Console.WriteLine("число является чётным");
//  }
//  else 
//  {
//  Console.WriteLine("число является не чётным");
//  }



/*Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8*/

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int start = 2;

// if(number > 1)
// {
//     while(start <= number)
//     {
//         Console.Write(start + " ");
//         start = start + 2;
//     }
// }



